ranjithaguna/pv/LED_Demo/source/pic32cx/component/emi.h
/**
 * \brief Component description for PIC32CX/0525SG12 EMI
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_EMI_COMPONENT_H_
#define _PIC32CX_0525SG12_EMI_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_EMI The Embedded Memory Interface (EMI) provides a standard run-time mechanism\n        for the system host to communicate with the Embedded Controller (EC) and other logical components.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR EMI */
/* ========================================================================== */

/* -------- EMI_HOST_EC_MBX : (EMI Offset: 0x00) (R/W 8) Host-to-EC Mailbox Register -------- */

typedef union
{
  uint8_t  w;
} __EMI_HOST_EC_MBX_bits_t;
#define EMI_HOST_EC_MBX_RESETVALUE          (0x00U)                                       /**<  (EMI_HOST_EC_MBX) Host-to-EC Mailbox Register  Reset Value */

#define EMI_HOST_EC_MBX_Msk                   (0x00000000UL)                                 /**< (EMI_HOST_EC_MBX) Register Mask  */

/* -------- EMI_EC_HOST_MBX : (EMI Offset: 0x01) (R/W 8) EC-to-Host Mailbox Register -------- */

typedef union
{
  uint8_t  w;
} __EMI_EC_HOST_MBX_bits_t;
#define EMI_EC_HOST_MBX_RESETVALUE          (0x00U)                                       /**<  (EMI_EC_HOST_MBX) EC-to-Host Mailbox Register  Reset Value */

#define EMI_EC_HOST_MBX_Msk                   (0x00000000UL)                                 /**< (EMI_EC_HOST_MBX) Register Mask  */

/* -------- EMI_EC_ADDRESS_LSB : (EMI Offset: 0x02) (R/W 8) EC Address Access Control Register -------- */

typedef union
{
  struct
  {
    uint8_t  ACCESS_TYPE:2;             /**< bit:   0..1  This field defines the type of access that occurs when the EC Data Register is read or written.\n                11b=Auto-increment 32-bit access. 10b=32-bit access. 01b=16-bit access. 00b=8-bit access. */
    uint8_t  EC_ADDRESS_LSB:6;          /**< bit:   2..7  This field defines bits[7:2] of EC_Address [15:0]. Bits[1:0] of the EC_Address are always forced to 00b.\n      The EC_Address is aligned on a DWord boundary. It is the address of the memory being accessed by EC Data Byte 0 Register, which is\n      an offset from the programmed base address of the selected REGION. */
  };
  uint8_t  w;
} __EMI_EC_ADDRESS_LSB_bits_t;
#define EMI_EC_ADDRESS_LSB_RESETVALUE       (0x00U)                                       /**<  (EMI_EC_ADDRESS_LSB) EC Address Access Control Register  Reset Value */

#define EMI_EC_ADDRESS_LSB_ACCESS_TYPE_Pos    (0)                                            /**< (EMI_EC_ADDRESS_LSB) This field defines the type of access that occurs when the EC Data Register is read or written.\n                11b=Auto-increment 32-bit access. 10b=32-bit access. 01b=16-bit access. 00b=8-bit access. Position */
#define EMI_EC_ADDRESS_LSB_ACCESS_TYPE_Msk    (0x3U << EMI_EC_ADDRESS_LSB_ACCESS_TYPE_Pos)   /**< (EMI_EC_ADDRESS_LSB) This field defines the type of access that occurs when the EC Data Register is read or written.\n                11b=Auto-increment 32-bit access. 10b=32-bit access. 01b=16-bit access. 00b=8-bit access. Mask */
#define EMI_EC_ADDRESS_LSB_ACCESS_TYPE(value) (EMI_EC_ADDRESS_LSB_ACCESS_TYPE_Msk & ((value) << EMI_EC_ADDRESS_LSB_ACCESS_TYPE_Pos))
#define EMI_EC_ADDRESS_LSB_EC_ADDRESS_LSB_Pos (2)                                            /**< (EMI_EC_ADDRESS_LSB) This field defines bits[7:2] of EC_Address [15:0]. Bits[1:0] of the EC_Address are always forced to 00b.\n      The EC_Address is aligned on a DWord boundary. It is the address of the memory being accessed by EC Data Byte 0 Register, which is\n      an offset from the programmed base address of the selected REGION. Position */
#define EMI_EC_ADDRESS_LSB_EC_ADDRESS_LSB_Msk (0x3FU << EMI_EC_ADDRESS_LSB_EC_ADDRESS_LSB_Pos)  /**< (EMI_EC_ADDRESS_LSB) This field defines bits[7:2] of EC_Address [15:0]. Bits[1:0] of the EC_Address are always forced to 00b.\n      The EC_Address is aligned on a DWord boundary. It is the address of the memory being accessed by EC Data Byte 0 Register, which is\n      an offset from the programmed base address of the selected REGION. Mask */
#define EMI_EC_ADDRESS_LSB_EC_ADDRESS_LSB(value) (EMI_EC_ADDRESS_LSB_EC_ADDRESS_LSB_Msk & ((value) << EMI_EC_ADDRESS_LSB_EC_ADDRESS_LSB_Pos))
#define EMI_EC_ADDRESS_LSB_Msk                (0x000000FFUL)                                 /**< (EMI_EC_ADDRESS_LSB) Register Mask  */

/* -------- EMI_EC_ADDRESS_MSB : (EMI Offset: 0x03) (R/W 8) EC Address Access Control Register -------- */

typedef union
{
  struct
  {
    uint8_t  :2;                        /**< bit:   0..1  Reserved                                      */
    uint8_t  EC_ADDRESS_MSB:5;          /**< bit:   2..6  This field defines bits[14:8] of EC_Address. Bits[1:0] of the EC_Address are always forced to 00b.\n      The EC_Address is aligned on a DWord boundary. It is the address of the memory being accessed by EC Data Byte 0 Register, which is\n      an offset from the programmed base address of the selected REGION. */
    uint8_t  REGION:1;                  /**< bit:      7  The field specifies which of two segments in the 32-bit internal address space is to be accessed by the EC_Address[14:2]\n      to generate accesses to the memory.\n      1=The address defined by EC_Address[14:2] is relative to the base address specified by the Memory Base Address 1 Register.\n      0=The address defined by EC_Address[14:2] is relative to the base address specified by the Memory Base Address 0 Register. */
  };
  uint8_t  w;
} __EMI_EC_ADDRESS_MSB_bits_t;
