ranjithaguna/pv/LED_Demo/source/pic32cx/component/emi.h
#define EMI_EC_ADDRESS_MSB_RESETVALUE       (0x00U)                                       /**<  (EMI_EC_ADDRESS_MSB) EC Address Access Control Register  Reset Value */

#define EMI_EC_ADDRESS_MSB_EC_ADDRESS_MSB_Pos (2)                                            /**< (EMI_EC_ADDRESS_MSB) This field defines bits[14:8] of EC_Address. Bits[1:0] of the EC_Address are always forced to 00b.\n      The EC_Address is aligned on a DWord boundary. It is the address of the memory being accessed by EC Data Byte 0 Register, which is\n      an offset from the programmed base address of the selected REGION. Position */
#define EMI_EC_ADDRESS_MSB_EC_ADDRESS_MSB_Msk (0x1FU << EMI_EC_ADDRESS_MSB_EC_ADDRESS_MSB_Pos)  /**< (EMI_EC_ADDRESS_MSB) This field defines bits[14:8] of EC_Address. Bits[1:0] of the EC_Address are always forced to 00b.\n      The EC_Address is aligned on a DWord boundary. It is the address of the memory being accessed by EC Data Byte 0 Register, which is\n      an offset from the programmed base address of the selected REGION. Mask */
#define EMI_EC_ADDRESS_MSB_EC_ADDRESS_MSB(value) (EMI_EC_ADDRESS_MSB_EC_ADDRESS_MSB_Msk & ((value) << EMI_EC_ADDRESS_MSB_EC_ADDRESS_MSB_Pos))
#define EMI_EC_ADDRESS_MSB_REGION_Pos         (7)                                            /**< (EMI_EC_ADDRESS_MSB) The field specifies which of two segments in the 32-bit internal address space is to be accessed by the EC_Address[14:2]\n      to generate accesses to the memory.\n      1=The address defined by EC_Address[14:2] is relative to the base address specified by the Memory Base Address 1 Register.\n      0=The address defined by EC_Address[14:2] is relative to the base address specified by the Memory Base Address 0 Register. Position */
#define EMI_EC_ADDRESS_MSB_REGION_Msk         (0x1U << EMI_EC_ADDRESS_MSB_REGION_Pos)        /**< (EMI_EC_ADDRESS_MSB) The field specifies which of two segments in the 32-bit internal address space is to be accessed by the EC_Address[14:2]\n      to generate accesses to the memory.\n      1=The address defined by EC_Address[14:2] is relative to the base address specified by the Memory Base Address 1 Register.\n      0=The address defined by EC_Address[14:2] is relative to the base address specified by the Memory Base Address 0 Register. Mask */
#define EMI_EC_ADDRESS_MSB_Msk                (0x000000FCUL)                                 /**< (EMI_EC_ADDRESS_MSB) Register Mask  */

/* -------- EMI_EC_DATA_BYTE : (EMI Offset: 0x04) (R/W 8) EC Data Byte Register -------- */

typedef union
{
  uint8_t  w;
} __EMI_EC_DATA_BYTE_bits_t;
#define EMI_EC_DATA_BYTE_RESETVALUE         (0x00U)                                       /**<  (EMI_EC_DATA_BYTE) EC Data Byte Register  Reset Value */

#define EMI_EC_DATA_BYTE_Msk                  (0x00000000UL)                                 /**< (EMI_EC_DATA_BYTE) Register Mask  */

/* -------- EMI_EC_INT_SOURCE_LSB : (EMI Offset: 0x08) (R/W 8) Interrupt Source LSB Register -------- */

typedef union
{
  struct
  {
    uint8_t  EC_WR:1;                   /**< bit:      0  EC Mailbox Write. This bit is set when the EC-to-HOST Mailbox Register has been written by the EC at offset 01h\n      of the EC-Only registers. Note: there is no corresponding mask bit in the Interrupt Mask LSB Register. */
    uint8_t  EC_SWI_LSB:7;              /**< bit:   1..7  EC Software Interrupt Least Significant Bits. These bits are software interrupt bits that may be set by the EC to\n      notify the host of an event. The meaning of these bits is dependent on the firmware implementation. Each bit in this field is cleared\n      when written with a '1b'. The ability to clear the bit can be disabled by the EC if the corresponding bit in the Host Clear Enable\n      Register is set to '0b'. This may be used by firmware for events that cannot be cleared while the event is still active. */
  };
  uint8_t  w;
} __EMI_EC_INT_SOURCE_LSB_bits_t;
#define EMI_EC_INT_SOURCE_LSB_RESETVALUE    (0x00U)                                       /**<  (EMI_EC_INT_SOURCE_LSB) Interrupt Source LSB Register  Reset Value */

#define EMI_EC_INT_SOURCE_LSB_EC_WR_Pos       (0)                                            /**< (EMI_EC_INT_SOURCE_LSB) EC Mailbox Write. This bit is set when the EC-to-HOST Mailbox Register has been written by the EC at offset 01h\n      of the EC-Only registers. Note: there is no corresponding mask bit in the Interrupt Mask LSB Register. Position */
#define EMI_EC_INT_SOURCE_LSB_EC_WR_Msk       (0x1U << EMI_EC_INT_SOURCE_LSB_EC_WR_Pos)      /**< (EMI_EC_INT_SOURCE_LSB) EC Mailbox Write. This bit is set when the EC-to-HOST Mailbox Register has been written by the EC at offset 01h\n      of the EC-Only registers. Note: there is no corresponding mask bit in the Interrupt Mask LSB Register. Mask */
#define EMI_EC_INT_SOURCE_LSB_EC_SWI_LSB_Pos  (1)                                            /**< (EMI_EC_INT_SOURCE_LSB) EC Software Interrupt Least Significant Bits. These bits are software interrupt bits that may be set by the EC to\n      notify the host of an event. The meaning of these bits is dependent on the firmware implementation. Each bit in this field is cleared\n      when written with a '1b'. The ability to clear the bit can be disabled by the EC if the corresponding bit in the Host Clear Enable\n      Register is set to '0b'. This may be used by firmware for events that cannot be cleared while the event is still active. Position */
#define EMI_EC_INT_SOURCE_LSB_EC_SWI_LSB_Msk  (0x7FU << EMI_EC_INT_SOURCE_LSB_EC_SWI_LSB_Pos)  /**< (EMI_EC_INT_SOURCE_LSB) EC Software Interrupt Least Significant Bits. These bits are software interrupt bits that may be set by the EC to\n      notify the host of an event. The meaning of these bits is dependent on the firmware implementation. Each bit in this field is cleared\n      when written with a '1b'. The ability to clear the bit can be disabled by the EC if the corresponding bit in the Host Clear Enable\n      Register is set to '0b'. This may be used by firmware for events that cannot be cleared while the event is still active. Mask */
#define EMI_EC_INT_SOURCE_LSB_EC_SWI_LSB(value) (EMI_EC_INT_SOURCE_LSB_EC_SWI_LSB_Msk & ((value) << EMI_EC_INT_SOURCE_LSB_EC_SWI_LSB_Pos))
#define EMI_EC_INT_SOURCE_LSB_Msk             (0x000000FFUL)                                 /**< (EMI_EC_INT_SOURCE_LSB) Register Mask  */

