ranjithaguna/pv/LED_Demo/source/pic32cx/component/emi.h
/* -------- EMI_EC_INT_SOURCE_MSB : (EMI Offset: 0x09) (R/W 8) Interrupt Source MSB Register -------- */

typedef union
{
  struct
  {
    uint8_t  EC_SWI_MSB:8;              /**< bit:   0..7  EC Software Interrupt Most Significant Bits. These bits are software interrupt bits that may be set by the EC to\n      notify the host of an event. The meaning of these bits is dependent on the firmware implementation. Each bit in this field is cleared\n      when written with a '1b'. The ability to clear the bit can be disabled by the EC if the corresponding bit in the Host Clear Enable\n      Register is set to '0b'. This may be used by firmware for events that cannot be cleared while the event is still active. */
  };
  uint8_t  w;
} __EMI_EC_INT_SOURCE_MSB_bits_t;
#define EMI_EC_INT_SOURCE_MSB_RESETVALUE    (0x00U)                                       /**<  (EMI_EC_INT_SOURCE_MSB) Interrupt Source MSB Register  Reset Value */

#define EMI_EC_INT_SOURCE_MSB_EC_SWI_MSB_Pos  (0)                                            /**< (EMI_EC_INT_SOURCE_MSB) EC Software Interrupt Most Significant Bits. These bits are software interrupt bits that may be set by the EC to\n      notify the host of an event. The meaning of these bits is dependent on the firmware implementation. Each bit in this field is cleared\n      when written with a '1b'. The ability to clear the bit can be disabled by the EC if the corresponding bit in the Host Clear Enable\n      Register is set to '0b'. This may be used by firmware for events that cannot be cleared while the event is still active. Position */
#define EMI_EC_INT_SOURCE_MSB_EC_SWI_MSB_Msk  (0xFFU << EMI_EC_INT_SOURCE_MSB_EC_SWI_MSB_Pos)  /**< (EMI_EC_INT_SOURCE_MSB) EC Software Interrupt Most Significant Bits. These bits are software interrupt bits that may be set by the EC to\n      notify the host of an event. The meaning of these bits is dependent on the firmware implementation. Each bit in this field is cleared\n      when written with a '1b'. The ability to clear the bit can be disabled by the EC if the corresponding bit in the Host Clear Enable\n      Register is set to '0b'. This may be used by firmware for events that cannot be cleared while the event is still active. Mask */
#define EMI_EC_INT_SOURCE_MSB_EC_SWI_MSB(value) (EMI_EC_INT_SOURCE_MSB_EC_SWI_MSB_Msk & ((value) << EMI_EC_INT_SOURCE_MSB_EC_SWI_MSB_Pos))
#define EMI_EC_INT_SOURCE_MSB_Msk             (0x000000FFUL)                                 /**< (EMI_EC_INT_SOURCE_MSB) Register Mask  */

/* -------- EMI_EC_INT_MASK_LSB : (EMI Offset: 0x0a) (R/W 8) Interrupt Mask LSB Register -------- */

typedef union
{
  struct
  {
    uint8_t  TEST:1;                    /**< bit:      0  Test Bit.                                     */
    uint8_t  EC_SWI_EN_LSB:7;           /**< bit:   1..7  EC Software Interrupt Enable Least Significant Bits. Each bit that is set to '1b' in this field enables the generation\n      of a Host Event interrupt by the corresponding bit in the EC_SWI field in the Interrupt Source LSB Register. */
  };
  uint8_t  w;
} __EMI_EC_INT_MASK_LSB_bits_t;
#define EMI_EC_INT_MASK_LSB_RESETVALUE      (0x00U)                                       /**<  (EMI_EC_INT_MASK_LSB) Interrupt Mask LSB Register  Reset Value */

#define EMI_EC_INT_MASK_LSB_TEST_Pos          (0)                                            /**< (EMI_EC_INT_MASK_LSB) Test Bit. Position */
#define EMI_EC_INT_MASK_LSB_TEST_Msk          (0x1U << EMI_EC_INT_MASK_LSB_TEST_Pos)         /**< (EMI_EC_INT_MASK_LSB) Test Bit. Mask */
#define EMI_EC_INT_MASK_LSB_EC_SWI_EN_LSB_Pos (1)                                            /**< (EMI_EC_INT_MASK_LSB) EC Software Interrupt Enable Least Significant Bits. Each bit that is set to '1b' in this field enables the generation\n      of a Host Event interrupt by the corresponding bit in the EC_SWI field in the Interrupt Source LSB Register. Position */
#define EMI_EC_INT_MASK_LSB_EC_SWI_EN_LSB_Msk (0x7FU << EMI_EC_INT_MASK_LSB_EC_SWI_EN_LSB_Pos)  /**< (EMI_EC_INT_MASK_LSB) EC Software Interrupt Enable Least Significant Bits. Each bit that is set to '1b' in this field enables the generation\n      of a Host Event interrupt by the corresponding bit in the EC_SWI field in the Interrupt Source LSB Register. Mask */
#define EMI_EC_INT_MASK_LSB_EC_SWI_EN_LSB(value) (EMI_EC_INT_MASK_LSB_EC_SWI_EN_LSB_Msk & ((value) << EMI_EC_INT_MASK_LSB_EC_SWI_EN_LSB_Pos))
#define EMI_EC_INT_MASK_LSB_Msk               (0x000000FFUL)                                 /**< (EMI_EC_INT_MASK_LSB) Register Mask  */

/* -------- EMI_EC_INT_MASK_MSB : (EMI Offset: 0x0b) (R/W 8) Interrupt Mask MSB Register -------- */

typedef union
{
  struct
  {
    uint8_t  :1;                        /**< bit:      0  Reserved                                      */
    uint8_t  EC_SWI_EN_MSB:7;           /**< bit:   1..7  EC Software Interrupt Enable Most Significant Bits. Each bit that is set to '1b' in this field enables the generation\n      of a Host Event interrupt by the corresponding bit in the EC_SWI field in the Interrupt Source MSB Register. */
  };
  uint8_t  w;
} __EMI_EC_INT_MASK_MSB_bits_t;
#define EMI_EC_INT_MASK_MSB_RESETVALUE      (0x00U)                                       /**<  (EMI_EC_INT_MASK_MSB) Interrupt Mask MSB Register  Reset Value */

#define EMI_EC_INT_MASK_MSB_EC_SWI_EN_MSB_Pos (1)                                            /**< (EMI_EC_INT_MASK_MSB) EC Software Interrupt Enable Most Significant Bits. Each bit that is set to '1b' in this field enables the generation\n      of a Host Event interrupt by the corresponding bit in the EC_SWI field in the Interrupt Source MSB Register. Position */
#define EMI_EC_INT_MASK_MSB_EC_SWI_EN_MSB_Msk (0x7FU << EMI_EC_INT_MASK_MSB_EC_SWI_EN_MSB_Pos)  /**< (EMI_EC_INT_MASK_MSB) EC Software Interrupt Enable Most Significant Bits. Each bit that is set to '1b' in this field enables the generation\n      of a Host Event interrupt by the corresponding bit in the EC_SWI field in the Interrupt Source MSB Register. Mask */
#define EMI_EC_INT_MASK_MSB_EC_SWI_EN_MSB(value) (EMI_EC_INT_MASK_MSB_EC_SWI_EN_MSB_Msk & ((value) << EMI_EC_INT_MASK_MSB_EC_SWI_EN_MSB_Pos))
#define EMI_EC_INT_MASK_MSB_Msk               (0x000000FEUL)                                 /**< (EMI_EC_INT_MASK_MSB) Register Mask  */

