ranjithaguna/pv/LED_Demo/source/pic32cx/component/emi.h
/* -------- EMI_APPLICATION_ID : (EMI Offset: 0x0c) (R/W 8) Application ID Register, APPLICATION_ID When this field is 00h it can be written with any value. When set to a non-zero value, writing that value will clear this register to 00h. When set to a non-zero value, writing any value other than the current contents will have no effect. -------- */

typedef union
{
  uint8_t  w;
} __EMI_APPLICATION_ID_bits_t;
#define EMI_APPLICATION_ID_RESETVALUE       (0x00U)                                       /**<  (EMI_APPLICATION_ID) Application ID Register, APPLICATION_ID When this field is 00h it can be written with any value. When set to a non-zero value, writing that value will clear this register to 00h. When set to a non-zero value, writing any value other than the current contents will have no effect.  Reset Value */

#define EMI_APPLICATION_ID_Msk                (0x00000000UL)                                 /**< (EMI_APPLICATION_ID) Register Mask  */

/* -------- EMI_HOST2EC_MBX : (EMI Offset: 0x100) (R/W 8) Host-to-EC Mailbox Register, 8-bit mailbox used communicate information from the system host to the embedded controller. Writing this register generates an event to notify the embedded controller. (R/WC) -------- */

typedef union
{
  uint8_t  w;
} __EMI_HOST2EC_MBX_bits_t;
#define EMI_HOST2EC_MBX_RESETVALUE          (0x00U)                                       /**<  (EMI_HOST2EC_MBX) Host-to-EC Mailbox Register, 8-bit mailbox used communicate information from the system host to the embedded controller. Writing this register generates an event to notify the embedded controller. (R/WC)  Reset Value */

#define EMI_HOST2EC_MBX_Msk                   (0x00000000UL)                                 /**< (EMI_HOST2EC_MBX) Register Mask  */

/* -------- EMI_EC2HOST_MBX : (EMI Offset: 0x101) (R/W 8) EC-to-Host Mailbox Register, 8-bit mailbox used communicate information from the embedded controller to the system host. Writing this register generates an event to notify the system host. -------- */

typedef union
{
  uint8_t  w;
} __EMI_EC2HOST_MBX_bits_t;
#define EMI_EC2HOST_MBX_RESETVALUE          (0x00U)                                       /**<  (EMI_EC2HOST_MBX) EC-to-Host Mailbox Register, 8-bit mailbox used communicate information from the embedded controller to the system host. Writing this register generates an event to notify the system host.  Reset Value */

#define EMI_EC2HOST_MBX_Msk                   (0x00000000UL)                                 /**< (EMI_EC2HOST_MBX) Register Mask  */

/* -------- EMI_MEMORY_BASE_ADDRESS_0 : (EMI Offset: 0x104) (R/W 32) Memory Base Address 0 Register [31:2] This memory base address defines the beginning of region 0 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 0 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 0. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_0 + EC_Address. -------- */

typedef union
{
  uint32_t w;
} __EMI_MEMORY_BASE_ADDRESS_0_bits_t;
#define EMI_MEMORY_BASE_ADDRESS_0_RESETVALUE (0x00U)                                       /**<  (EMI_MEMORY_BASE_ADDRESS_0) Memory Base Address 0 Register [31:2] This memory base address defines the beginning of region 0 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 0 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 0. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_0 + EC_Address.  Reset Value */

#define EMI_MEMORY_BASE_ADDRESS_0_Msk         (0x00000000UL)                                 /**< (EMI_MEMORY_BASE_ADDRESS_0) Register Mask  */

/* -------- EMI_MEMORY_READ_LIMIT_0 : (EMI Offset: 0x108) (R/W 16) Memory Read Limit 0 Register [14:2] Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_Address is 0, the field EC_Address[14:2] in the EC_Address_Register is compared to this field. As long as EC_Address[14:2] is less than this field the EC_Data_Register will be loaded from the 24-bit internal address space. -------- */

typedef union
{
  uint16_t w;
} __EMI_MEMORY_READ_LIMIT_0_bits_t;
#define EMI_MEMORY_READ_LIMIT_0_RESETVALUE  (0x00U)                                       /**<  (EMI_MEMORY_READ_LIMIT_0) Memory Read Limit 0 Register [14:2] Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_Address is 0, the field EC_Address[14:2] in the EC_Address_Register is compared to this field. As long as EC_Address[14:2] is less than this field the EC_Data_Register will be loaded from the 24-bit internal address space.  Reset Value */

#define EMI_MEMORY_READ_LIMIT_0_Msk           (0x00000000UL)                                 /**< (EMI_MEMORY_READ_LIMIT_0) Register Mask  */

/* -------- EMI_MEMORY_WRITE_LIMIT_0 : (EMI Offset: 0x10a) (R/W 16) Memory Write Limit 0 Register [14:2] Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 0, the field EC_ADDRESS_MSB in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_0[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_0[14:2] no writes will take place. -------- */

typedef union
{
  uint16_t w;
} __EMI_MEMORY_WRITE_LIMIT_0_bits_t;
#define EMI_MEMORY_WRITE_LIMIT_0_RESETVALUE (0x00U)                                       /**<  (EMI_MEMORY_WRITE_LIMIT_0) Memory Write Limit 0 Register [14:2] Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 0, the field EC_ADDRESS_MSB in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_0[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_0[14:2] no writes will take place.  Reset Value */

#define EMI_MEMORY_WRITE_LIMIT_0_Msk          (0x00000000UL)                                 /**< (EMI_MEMORY_WRITE_LIMIT_0) Register Mask  */

/* -------- EMI_MEMORY_BASE_ADDRESS_1 : (EMI Offset: 0x10c) (R/W 32) Memory Base Address 1 Register. [31:2] This memory base address defines the beginning of region 1 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 1 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 1. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_1 + EC_Address. -------- */

typedef union
{
  uint32_t w;
} __EMI_MEMORY_BASE_ADDRESS_1_bits_t;
#define EMI_MEMORY_BASE_ADDRESS_1_RESETVALUE (0x00U)                                       /**<  (EMI_MEMORY_BASE_ADDRESS_1) Memory Base Address 1 Register. [31:2] This memory base address defines the beginning of region 1 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 1 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 1. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_1 + EC_Address.  Reset Value */

#define EMI_MEMORY_BASE_ADDRESS_1_Msk         (0x00000000UL)                                 /**< (EMI_MEMORY_BASE_ADDRESS_1) Register Mask  */

/* -------- EMI_MEMORY_READ_LIMIT_1 : (EMI Offset: 0x110) (R/W 16) Memory Read Limit 1 Register, [14:2]: Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_ADDRESS is 1, the field EC_ADDRESS in the EC_Address_Register is compared to this field. As long as EC_ADDRESS is less than this value, the EC_Data_Register will be loaded from the 24-bit internal address space. -------- */

typedef union
{
  uint16_t w;
} __EMI_MEMORY_READ_LIMIT_1_bits_t;
