ranjithaguna/pv/LED_Demo/source/pic32cx/component/emi.h
#define EMI_MEMORY_READ_LIMIT_1_RESETVALUE  (0x00U)                                       /**<  (EMI_MEMORY_READ_LIMIT_1) Memory Read Limit 1 Register, [14:2]: Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_ADDRESS is 1, the field EC_ADDRESS in the EC_Address_Register is compared to this field. As long as EC_ADDRESS is less than this value, the EC_Data_Register will be loaded from the 24-bit internal address space.  Reset Value */

#define EMI_MEMORY_READ_LIMIT_1_Msk           (0x00000000UL)                                 /**< (EMI_MEMORY_READ_LIMIT_1) Register Mask  */

/* -------- EMI_MEMORY_WRITE_LIMIT_1 : (EMI Offset: 0x112) (R/W 16) Memory Write Limit 1 Register, [14:2]: Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 1, the field EC_Address[14:2] in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_1[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_1[14:2] no writes will take place. -------- */

typedef union
{
  uint16_t w;
} __EMI_MEMORY_WRITE_LIMIT_1_bits_t;
#define EMI_MEMORY_WRITE_LIMIT_1_RESETVALUE (0x00U)                                       /**<  (EMI_MEMORY_WRITE_LIMIT_1) Memory Write Limit 1 Register, [14:2]: Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 1, the field EC_Address[14:2] in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_1[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_1[14:2] no writes will take place.  Reset Value */

#define EMI_MEMORY_WRITE_LIMIT_1_Msk          (0x00000000UL)                                 /**< (EMI_MEMORY_WRITE_LIMIT_1) Register Mask  */

/* -------- EMI_EC_SWI_SET : (EMI Offset: 0x114) (R/W 16) [15:1] Interrupt Set Register, Writing a bit in this field with a '1b' sets the corresponding bit in the Interrupt Source Register to '1b'. Writing a bit in this field with a '0b' has no effect. Reading this field returns the current contents of the Interrupt Source Register. -------- */

typedef union
{
  uint16_t w;
} __EMI_EC_SWI_SET_bits_t;
#define EMI_EC_SWI_SET_RESETVALUE           (0x00U)                                       /**<  (EMI_EC_SWI_SET) [15:1] Interrupt Set Register, Writing a bit in this field with a '1b' sets the corresponding bit in the Interrupt Source Register to '1b'. Writing a bit in this field with a '0b' has no effect. Reading this field returns the current contents of the Interrupt Source Register.  Reset Value */

#define EMI_EC_SWI_SET_Msk                    (0x00000000UL)                                 /**< (EMI_EC_SWI_SET) Register Mask  */

/* -------- EMI_CLEAR_ENABLE : (EMI Offset: 0x116) (R/W 16) [15:1] Host Clear Enable Register, When a bit in this field is '0b', the corresponding bit in the Interrupt Source Register cannot be cleared by writes to the Interrupt Source Register. When a bit in this field is '1b', the corresponding bit in the Interrupt Source Register can be cleared when that register bit is written with a '1b'. -------- */

typedef union
{
  uint16_t w;
} __EMI_CLEAR_ENABLE_bits_t;
#define EMI_CLEAR_ENABLE_RESETVALUE         (0x00U)                                       /**<  (EMI_CLEAR_ENABLE) [15:1] Host Clear Enable Register, When a bit in this field is '0b', the corresponding bit in the Interrupt Source Register cannot be cleared by writes to the Interrupt Source Register. When a bit in this field is '1b', the corresponding bit in the Interrupt Source Register can be cleared when that register bit is written with a '1b'.  Reset Value */

#define EMI_CLEAR_ENABLE_Msk                  (0x00000000UL)                                 /**< (EMI_CLEAR_ENABLE) Register Mask  */

/** \brief EMI register offsets definitions */
#define EMI_HOST_EC_MBX_OFFSET       (0x00)         /**< (EMI_HOST_EC_MBX) Host-to-EC Mailbox Register Offset */
#define EMI_EC_HOST_MBX_OFFSET       (0x01)         /**< (EMI_EC_HOST_MBX) EC-to-Host Mailbox Register Offset */
#define EMI_EC_ADDRESS_LSB_OFFSET    (0x02)         /**< (EMI_EC_ADDRESS_LSB) EC Address Access Control Register Offset */
#define EMI_EC_ADDRESS_MSB_OFFSET    (0x03)         /**< (EMI_EC_ADDRESS_MSB) EC Address Access Control Register Offset */
#define EMI_EC_DATA_BYTE_OFFSET      (0x04)         /**< (EMI_EC_DATA_BYTE) EC Data Byte Register Offset */
#define EMI_EC_INT_SOURCE_LSB_OFFSET (0x08)         /**< (EMI_EC_INT_SOURCE_LSB) Interrupt Source LSB Register Offset */
#define EMI_EC_INT_SOURCE_MSB_OFFSET (0x09)         /**< (EMI_EC_INT_SOURCE_MSB) Interrupt Source MSB Register Offset */
#define EMI_EC_INT_MASK_LSB_OFFSET   (0x0A)         /**< (EMI_EC_INT_MASK_LSB) Interrupt Mask LSB Register Offset */
#define EMI_EC_INT_MASK_MSB_OFFSET   (0x0B)         /**< (EMI_EC_INT_MASK_MSB) Interrupt Mask MSB Register Offset */
#define EMI_APPLICATION_ID_OFFSET    (0x0C)         /**< (EMI_APPLICATION_ID) Application ID Register, APPLICATION_ID When this field is 00h it can be written with any value. When set to a non-zero value, writing that value will clear this register to 00h. When set to a non-zero value, writing any value other than the current contents will have no effect. Offset */
#define EMI_HOST2EC_MBX_OFFSET       (0x100)        /**< (EMI_HOST2EC_MBX) Host-to-EC Mailbox Register, 8-bit mailbox used communicate information from the system host to the embedded controller. Writing this register generates an event to notify the embedded controller. (R/WC) Offset */
#define EMI_EC2HOST_MBX_OFFSET       (0x101)        /**< (EMI_EC2HOST_MBX) EC-to-Host Mailbox Register, 8-bit mailbox used communicate information from the embedded controller to the system host. Writing this register generates an event to notify the system host. Offset */
#define EMI_MEMORY_BASE_ADDRESS_0_OFFSET (0x104)        /**< (EMI_MEMORY_BASE_ADDRESS_0) Memory Base Address 0 Register [31:2] This memory base address defines the beginning of region 0 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 0 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 0. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_0 + EC_Address. Offset */
#define EMI_MEMORY_READ_LIMIT_0_OFFSET (0x108)        /**< (EMI_MEMORY_READ_LIMIT_0) Memory Read Limit 0 Register [14:2] Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_Address is 0, the field EC_Address[14:2] in the EC_Address_Register is compared to this field. As long as EC_Address[14:2] is less than this field the EC_Data_Register will be loaded from the 24-bit internal address space. Offset */
#define EMI_MEMORY_WRITE_LIMIT_0_OFFSET (0x10A)        /**< (EMI_MEMORY_WRITE_LIMIT_0) Memory Write Limit 0 Register [14:2] Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 0, the field EC_ADDRESS_MSB in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_0[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_0[14:2] no writes will take place. Offset */
#define EMI_MEMORY_BASE_ADDRESS_1_OFFSET (0x10C)        /**< (EMI_MEMORY_BASE_ADDRESS_1) Memory Base Address 1 Register. [31:2] This memory base address defines the beginning of region 1 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 1 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 1. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_1 + EC_Address. Offset */
#define EMI_MEMORY_READ_LIMIT_1_OFFSET (0x110)        /**< (EMI_MEMORY_READ_LIMIT_1) Memory Read Limit 1 Register, [14:2]: Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_ADDRESS is 1, the field EC_ADDRESS in the EC_Address_Register is compared to this field. As long as EC_ADDRESS is less than this value, the EC_Data_Register will be loaded from the 24-bit internal address space. Offset */
#define EMI_MEMORY_WRITE_LIMIT_1_OFFSET (0x112)        /**< (EMI_MEMORY_WRITE_LIMIT_1) Memory Write Limit 1 Register, [14:2]: Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 1, the field EC_Address[14:2] in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_1[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_1[14:2] no writes will take place. Offset */
#define EMI_EC_SWI_SET_OFFSET        (0x114)        /**< (EMI_EC_SWI_SET) [15:1] Interrupt Set Register, Writing a bit in this field with a '1b' sets the corresponding bit in the Interrupt Source Register to '1b'. Writing a bit in this field with a '0b' has no effect. Reading this field returns the current contents of the Interrupt Source Register. Offset */
#define EMI_CLEAR_ENABLE_OFFSET      (0x116)        /**< (EMI_CLEAR_ENABLE) [15:1] Host Clear Enable Register, When a bit in this field is '0b', the corresponding bit in the Interrupt Source Register cannot be cleared by writes to the Interrupt Source Register. When a bit in this field is '1b', the corresponding bit in the Interrupt Source Register can be cleared when that register bit is written with a '1b'. Offset */

