ranjithaguna/pv/LED_Demo/source/pic32cx/component/emi.h
/** \brief EMI register API structure */
typedef struct
{  /* The Embedded Memory Interface (EMI) provides a standard run-time mechanism\n        for the system host to communicate with the Embedded Controller (EC) and other logical components. */
  __IO  __EMI_HOST_EC_MBX_bits_t       HOST_EC_MBX;   /**< Offset: 0x00 (R/W   8) Host-to-EC Mailbox Register */
  __IO  __EMI_EC_HOST_MBX_bits_t       EC_HOST_MBX;   /**< Offset: 0x01 (R/W   8) EC-to-Host Mailbox Register */
  __IO  __EMI_EC_ADDRESS_LSB_bits_t    EC_ADDRESS_LSB; /**< Offset: 0x02 (R/W   8) EC Address Access Control Register */
  __IO  __EMI_EC_ADDRESS_MSB_bits_t    EC_ADDRESS_MSB; /**< Offset: 0x03 (R/W   8) EC Address Access Control Register */
  __IO  __EMI_EC_DATA_BYTE_bits_t      EC_DATA_BYTE[4]; /**< Offset: 0x04 (R/W   8) EC Data Byte Register */
  __IO  __EMI_EC_INT_SOURCE_LSB_bits_t EC_INT_SOURCE_LSB; /**< Offset: 0x08 (R/W   8) Interrupt Source LSB Register */
  __IO  __EMI_EC_INT_SOURCE_MSB_bits_t EC_INT_SOURCE_MSB; /**< Offset: 0x09 (R/W   8) Interrupt Source MSB Register */
  __IO  __EMI_EC_INT_MASK_LSB_bits_t   EC_INT_MASK_LSB; /**< Offset: 0x0A (R/W   8) Interrupt Mask LSB Register */
  __IO  __EMI_EC_INT_MASK_MSB_bits_t   EC_INT_MASK_MSB; /**< Offset: 0x0B (R/W   8) Interrupt Mask MSB Register */
  __IO  __EMI_APPLICATION_ID_bits_t    APPLICATION_ID; /**< Offset: 0x0C (R/W   8) Application ID Register, APPLICATION_ID When this field is 00h it can be written with any value. When set to a non-zero value, writing that value will clear this register to 00h. When set to a non-zero value, writing any value other than the current contents will have no effect. */
  __IO  __EMI_HOST2EC_MBX_bits_t       HOST2EC_MBX;   /**< Offset: 0x100 (R/W   8) Host-to-EC Mailbox Register, 8-bit mailbox used communicate information from the system host to the embedded controller. Writing this register generates an event to notify the embedded controller. (R/WC) */
  __IO  __EMI_EC2HOST_MBX_bits_t       EC2HOST_MBX;   /**< Offset: 0x101 (R/W   8) EC-to-Host Mailbox Register, 8-bit mailbox used communicate information from the embedded controller to the system host. Writing this register generates an event to notify the system host. */
  __IO  __EMI_MEMORY_BASE_ADDRESS_0_bits_t MEMORY_BASE_ADDRESS_0; /**< Offset: 0x104 (R/W  32) Memory Base Address 0 Register [31:2] This memory base address defines the beginning of region 0 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 0 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 0. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_0 + EC_Address. */
  __IO  __EMI_MEMORY_READ_LIMIT_0_bits_t MEMORY_READ_LIMIT_0; /**< Offset: 0x108 (R/W  16) Memory Read Limit 0 Register [14:2] Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_Address is 0, the field EC_Address[14:2] in the EC_Address_Register is compared to this field. As long as EC_Address[14:2] is less than this field the EC_Data_Register will be loaded from the 24-bit internal address space. */
  __IO  __EMI_MEMORY_WRITE_LIMIT_0_bits_t MEMORY_WRITE_LIMIT_0; /**< Offset: 0x10A (R/W  16) Memory Write Limit 0 Register [14:2] Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 0, the field EC_ADDRESS_MSB in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_0[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_0[14:2] no writes will take place. */
  __IO  __EMI_MEMORY_BASE_ADDRESS_1_bits_t MEMORY_BASE_ADDRESS_1; /**< Offset: 0x10C (R/W  32) Memory Base Address 1 Register. [31:2] This memory base address defines the beginning of region 1 in the Embedded Controller's 32-bit internal address space. Memory allocated to region 1 is intended to be shared between the Host and the EC. The region defined by this base register is used when bit 15 of the EC Address Register is 1. The access will be to a memory location at an offset defined by the EC_Address relative to the beginning of the region defined by this register. Therefore, a read or write to the memory that is triggered by the EC Data Register will occur at Memory_Base_Address_1 + EC_Address. */
  __IO  __EMI_MEMORY_READ_LIMIT_1_bits_t MEMORY_READ_LIMIT_1; /**< Offset: 0x110 (R/W  16) Memory Read Limit 1 Register, [14:2]: Whenever a read of any byte in the EC Data Register is attempted, and bit 15 of EC_ADDRESS is 1, the field EC_ADDRESS in the EC_Address_Register is compared to this field. As long as EC_ADDRESS is less than this value, the EC_Data_Register will be loaded from the 24-bit internal address space. */
  __IO  __EMI_MEMORY_WRITE_LIMIT_1_bits_t MEMORY_WRITE_LIMIT_1; /**< Offset: 0x112 (R/W  16) Memory Write Limit 1 Register, [14:2]: Whenever a write of any byte in EC DATA Register is attempted and bit 15 of EC_Address is 1, the field EC_Address[14:2] in the EC_Address Register is compared to this field. As long as EC_Address[14:2] is less than Memory_Write_Limit_1[14:2] the addressed bytes in the EC DATA Register will be written into the internal 24-bit address space. If EC_Address[14:2] is greater than or equal to the Memory_Write_Limit_1[14:2] no writes will take place. */
  __IO  __EMI_EC_SWI_SET_bits_t        EC_SWI_SET;    /**< Offset: 0x114 (R/W  16) [15:1] Interrupt Set Register, Writing a bit in this field with a '1b' sets the corresponding bit in the Interrupt Source Register to '1b'. Writing a bit in this field with a '0b' has no effect. Reading this field returns the current contents of the Interrupt Source Register. */
  __IO  __EMI_CLEAR_ENABLE_bits_t      CLEAR_ENABLE;  /**< Offset: 0x116 (R/W  16) [15:1] Host Clear Enable Register, When a bit in this field is '0b', the corresponding bit in the Interrupt Source Register cannot be cleared by writes to the Interrupt Source Register. When a bit in this field is '1b', the corresponding bit in the Interrupt Source Register can be cleared when that register bit is written with a '1b'. */
} emi_registers_t;
/** @}  end of The Embedded Memory Interface (EMI) provides a standard run-time mechanism\n        for the system host to communicate with the Embedded Controller (EC) and other logical components. */

#endif /* _PIC32CX_0525SG12_EMI_COMPONENT_H_ */
